///* Первое занятие

// Вводные

///* int a = 25;
// double b = 36.6;
// string c = "Hello world";
// bool d = true;

// int number1 = 5;
// int number2 = 7;

// Console.WriteLine("My numbers is " + number1);
// Console.WriteLine($"My numbers is {number2} ");

// Console.Write ("Input a number: ");
// int num = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Your nubber is " + num);

///* Task 1. Напишите программу, которая на вход принимает два числа и проверяет, является ли первоечисло квадратом второго.

// Console.Write("Input a first number: ");
// int num1= Convert.ToInt32(Console.ReadLine());
// Console.Write("Input a second number: ");
// int num2= Convert.ToInt32(Console.ReadLine());

// // int quad2 = num2 * num2;

// // ///if(num1 == quad2) можно по другогу см. ниже
// if(num1 == num2 * num2)
// {
//     Console.Write("Yes");
// }
//     else
//     {
//     Console.Write("No");
//     }


///* 
// Task 2 Напишите программу, которая на вход принимает одно число (number), а на выходе показывает все целые числа в промежутке от -number до number.

// Console.Write ("Input a positive number: ");
// int number = Convert.ToInt32(Console.ReadLine());

// int current = -number;   // стартуем

// while(current <= number)
// {
//     Console.Write(current + " ");
//     current++;
// }

///*  Task 3. Написать программу которая на вход принимает два числа и выдаёт большее. 
// то ставит, что числа ровны. УТОЧНИТЬ КАК ДЕЛЬТЬ ЧТОБЫ МАКСИМАЛЬНОЕ
// ВВОДИМОЕ ЧИСЛО БЫЛО Семь??

// A = 5;
// B = 7;
// max = 7.

// Console.Write("Input a first number: ");
// int num1 = Convert.ToInt32(Console.ReadLine());

// Console.Write("Input second number: ");
// int num2 = Convert.ToInt32(Console.ReadLine());

// if (num1 > num2)
// {
//         Console.Write("max = " + num1);
// }
//     else
//     {
//         Console.Write("max = " + num2);
//     }

// Task 3.1. Написать программу которая на вход принимает два числа и выдаёт большее.

// A = 2;
// B = 10;
// max = 10.

// Console.Write ("Input a first number: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Input a second number: ");
// int num2 = Convert.ToInt32(Console.ReadLine());

// if (num1 > num2)
// {
//     Console.Write("max = " + num1);
// }
// else
// {
//     Console.Write("max = " + num2);
// }

// Task 3.2. Написать задачу которая на вход принимает два числа и выдаёт большее.

// a = -9;
// b = -3;
// max = -3.

// Console.Write("Input a first number: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Input a second number: ");
// int num2 = Convert.ToInt32(Console.ReadLine());

// if (num1 > num2)
// {
//     Console.Write("max = " + num1);
// }
// else
// {
//     Console.Write("max = " + num2);
// }

///*Task 4. Напишите программу которая на вход принимает три числа и выдаёт большее.
//Console.Write("Input a first number: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Input a second number: ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Input a third numbers: ");
// int num3 = Convert.ToInt32(Console.ReadLine());

// int max = num1;

// if (num2 > max)
// {
//     max = num2;
// }
// if (num3 > max)
// {
//     max = num3;
// }
// Console.WriteLine($"max = {max}");

///*  Task 6. Напишите программу, которая на вход принимает одно число и выдаёт, является ли число чётным.
 //  // (Делится ли оно без остатка) СДЕЛАТЬ ЧЕРЕЗ CURRENT.

//  Console.Write ("Input a number: ");
//  int number = Convert.ToInt32(Console.ReadLine());

// if (number % 2 == 0)
// {
//     Console.Write("Число является чётным.");
// }
// else
// {
//     Console.Write("Число является не чётным.");
// }
 

    


